{
  "data": [
    {
      "body": "<p>I think the games that have had the most consistent impact on me in the past have been survival horror games. But what makes a survival horror game perfect?</p>\n<p>A survival horror game transcends the genre when it uses horror elements to effectively enhance its non-horror message. Here are some examples:</p>\n<p>System Shock 2, Half Life and Half Life 2, Portal and Portal 2, Fallout 3, MGS2 &amp; 3. I would consider all these to be games that have themes beyond “escape” or “survival”, and the elements of horror in these games support these non-horror themes.</p>\n<p>In theory, the horror in these games awakens a primal sense of danger in the player, and that fear galvanizes the existing themes of the story and makes them more memorable and impactful.</p>\n<p>I can point to any of these games and tell you the exact beats where horror supports the overall message, but let’s start with my poster child, Fallout 3.</p>\n<h2>Fallout 3 is Bethesda’s best horror game</h2>\n<p>The Super Duper Mart. The Capital Wasteland. The DC Ruins. Trainquility Lane. Vault 87. The Dunwich Building.</p>\n<p>These are some of the scariest locations in the game, and most of them fall on the main quest line, meaning you have to move through them to progress.</p>\n<p>Let’s pause and unpack this. If you were to get stuck in any of those places, you’d have a uniquely awful experience. You could be:</p>\n<ol>\n<li>Enslaved by sadomasochist serial killers whacked out of their minds on drugs.</li>\n<li>Poisoned with radiation, slowly melting your skin and turning you into a literal zombie.</li>\n<li>Crushed by the brutal, ceaseless violence of super mutant insurrectionists.</li>\n<li>Trapped in a computer simulation, to be psychlogically tortured forever.</li>\n<li>Mutated into a Cronenburg-esque, body-horror flesh monster.</li>\n<li>Sacrificed to an unknowable entity of cosmic malice.</li>\n</ol>\n<p>When it comes to awful ways to die, you’re spoiled for choice in Fallout 3. But these gruesome places aren’t just there for giggles. Every horrorifying encounter in Fallout 3 enhances the game’s themes:</p>\n<h2>How horror enhances the themes of Fallout 3</h2>\n<p>War never changes. Survival of the fittest. Tribalism. Society is brittle. History repeats itself. These are some of the themes of Fallout 3.</p>\n<p>At the beginning of the game, your character is incredibly weak. At low levels, the world is providing very real threats to your existence behind every wrecked automobile shell and collapsed building.</p>\n<p>This is made worse because it’s ONLY YOU out there in combat. Be honest, for most of your first playthrough of Fallout 3, you probably didn’t have Jericho or Dog Meat backing you up.</p>\n<p>However, at higher levels, the tide starts to turn. Suddenly the gang of super mutants attacking Bigtown is a mild inconveinance, not a skin-of-your-teeth, save-scumming victory. Even threats like Death Claws and Super Mutant Behemouths become manageable when you have plasma weapons and power armor.</p>\n<p>You can even befriend the world’s unstoppable force, super mutant Fawkes, but only AFTER you’ve crept through the rusted, infected carbon copy of your childhood home, Vault 87.</p>\n<p>Contrast that with sequel New Vegas, where most players easily found Boone in Novac, the game’s third peaceful settlement. Most of us probably kept the dead-shot body guard all the way until the Hoover Dam. Maybe that’s why New Vegas didn’t feel as threatening.</p>\n<p>The design of Fallout 3 requires the player to get stronger over time, but only by doing hard things. By combating legions of ghouls in abandoned office buildings and subway tunnels across the territory, your character toughens up. Your progression is earned the hard way.</p>\n<p>The only reprieve is returning to a settlement like Rivet City or Megaton to sell off the scrap you’ve collected, so you can buy more ammo or a better gun.</p>\n<p>This cycle of combat and calm happens continuously for the whole game, and before you know it, you have adapted to this new grotesque world.</p>\n<p>As you continue to play, and willingly dive into a new hell of another optional Vault, you realize that something inside you is different now. You used to be terrified of these dark places.</p>\n<p>Your in-game character isn’t the only thing that’s leveled up. Despite the body horror and vintage sci-fi aesthetic, war never changed. But you did.</p>\n<h2>Final Thoughts</h2>\n<p>There is obviously a lot of crossover between the post apocalyptic and horror genres, going back all the way to the book <em>Alas, Babylon</em>. And in some ways, post apocolytic is a subset of horror.</p>\n<p>But my concept of the perfect survival horror game requires more than simple adherence to the genre. Fallout 3 bends the genre to its message, and that is a level of craft that may be overlooked or forgotten by modern audiences, and definitely doesn’t get enough credit.</p>\n<p>Ask any Bethesda fan which modern Fallout experience they prefer, and most will probably say New Vegas. I love New Vegas, but it doesn’t affect me on a deeply personal level like Fallout 3 does.</p>\n<p>I believe the reason is that Fallout 3 offers a truly menacing challenge, and therefore, an opportunity for personal growth outside the game.</p>\n<p>You can also find similar experiences aboard the Von Braun, in Ravenholm, and inside Big Shell, but the Capital Wasteland sets a new standard. Fallout 3 is and will remain the G.O.A.T. of survival horror.</p>\n",
      "title": "Fallout 3 is the perfect Survival Horror game",
      "date": "2024-12-06 08:00 AM",
      "description": "My thoughts on the over-shadowed survival horror classic that restarted a franchise..",
      "isCompleted": true,
      "slug": "fallout-3-is-the-perfect-survival-horror-game",
      "tags": [
        "game design"
      ]
    },
    {
      "body": "<p>“If you’re not making quantitative predictions, you’re probably doing it wrong.” Gabe Newel, speaking about his company’s approach to design in this video: <a href=\"https://youtu.be/Td_PGkfIdIQ?t=1471\">https://youtu.be/Td_PGkfIdIQ?t=1471</a></p>\n<p>This quote from the founder of Valve got me thinking: What does it that look like in practice? What even is a quantitative prediction?</p>\n<p>As a guy who wants to produce video games, it seems like a useful practice to employ.</p>\n<p>So I did what any self-respecting person would do. I tried to Google it. But Google’s search results are filled up with so many useless blog posts now, I gave up!</p>\n<p>So instead of doing that, I turned to the next best search engine: Chat GPT. That at least got me to an outline of what I wanted. So I took that and refined it into a more generalized approach:</p>\n<h2>How to make a Quantitative Prediction:</h2>\n<ol>\n<li>Write down what you want to predict.</li>\n<li>Get data: Look at any available past trends.</li>\n<li>List dependent variables: What affects my prediction? What limits are there?</li>\n<li>Choose a Prediction Method\n<ol>\n<li>Simple Estimation</li>\n<li>Trend Analysis: Linear Regression from Historial Data</li>\n<li>Statistical Modeling: Multi regression or time-series analysis.</li>\n<li>Simulation: Create scenarios using tools like Monte Carlo simulations.</li>\n</ol></li>\n<li>List independent variables: Make some guesses (assumptions).</li>\n<li>Write down the prediction’s hypothesis, and review it once it’s proved right or wrong.</li>\n</ol>\n<h2>In Practice</h2>\n<p>Clear as mud right? It reminds me of a book I read a few years ago called <em>Superforecasting, the Art and Science of Prediction</em>, by Phillip Tetlock which dealt with the difference between pundit predictions and the small subset of people who can make accurate geopolitical predictions.</p>\n<p>That said, making a video game more fun isn’t nearly as important as whether or not the war in Ukraine will last another 12 months, but that doesn't mean I can slack off and do this lazy-style. So let’s try an example:</p>\n<h2>Example</h2>\n<ol>\n<li>I want to predict if the majority of playtesters find combat in <em>Esmeralda: The Black Amber Covenant</em> fun or tedious.</li>\n<li>Games in the past have used my style of real-time, melee combat, with enemies moving in 8 directions. LTTP sold very well with that style.</li>\n<li>Reactivity in attack animations, number of bugs in the game, range of enemies, range of player, health of enemies, health of player, hitbox size of player, hitbox size of enemy pathfinding ai, playtester skill.</li>\n<li>Simple Estimates based on a single session play test with 3 playtesters (so no ties)</li>\n<li>Hardware functionality / control scheme layout doesn’t need to be fancy.</li>\n<li>Hypothesis:\n<ol>\n<li>If the player can hit opponents from slightly farther away than the enemy can, players will find the combat more fun.</li>\n<li>The player will enjoy combat more if they move faster than most of the enemies, or if enemies pause breifly instead of pathing like minecraft zombies that never relent.</li>\n<li>The player will enjoy combat more if they hit the enemy when they intend to, on average 60% of the time. (Is 60% too low?)</li>\n</ol></li>\n</ol>\n<p>In writing this, I wonder if this is using the wrong tool for the job. Can the rigidity of the scientific method really explain something like game feel? The data I gathered seemed more vague and annecdotal.</p>\n<p>Anyways, I plan to run this experiment with three playtesters, to see how my 3 hypothesis pan out. Then, I intend to post the results below.</p>\n",
      "title": "How to apply quantitative predictions to game design",
      "date": "2024-12-05 08:00 AM",
      "description": "Industry leader Gabe Newel espouses the virtures of quantitative predictions, but how does that work in practice?",
      "isCompleted": true,
      "slug": "how-to-apply-quantitative-predictions-to-game-design",
      "tags": [
        "game dev",
        "predictions"
      ]
    },
    {
      "body": "<p>ETBAC is a game I’ve been working on (in some guise) since 2020. It’s a part-time, labor of love project, but I’m trying to take it as seriously as possible. I have big dreams for it, hopefully it gets to be as big as Stardew Valley someday.</p>\n<p>Like SV, it’s a top-down adventure style game. It also is heavily inspired by Legend of Zelda: Link to the Past, and Castlevania: Symphony of the Night. It also draws on minimalist design styles from Gen 3 Pokemon and Earthbound to render the adventure.</p>\n<h3>Features</h3>\n<p>ETBAC hase 3 major pillars to its overall design:</p>\n<ol>\n<li>Combat: Action-Adventure hack and slash, real-time combat.</li>\n<li>Narrative: Full Bethesda-esque Quest system, moral choices and an open world to explore.</li>\n<li>Collect-a-thon: Acquire loot and resources to cprogress in the game.</li>\n</ol>\n<h2>Context</h2>\n<p>Become the apprentice to a witch and explore the land of Esmeralda, while using your wit, strength, and new-found magical abilities to unravel a long-secret truce between the natural and supernatural worlds.</p>\n<h2>Release</h2>\n<p>December 2025 for Android / IOS / PC</p>\n",
      "title": "What is Esmerelda: The Black Amber Covenant?",
      "date": "2024-12-04 08:00 AM",
      "description": "A top-down, action-RPG focused on story, player choice, and team-based melee combat.",
      "isCompleted": true,
      "slug": "what-is-esmerelda-the-black-amber-covenant",
      "tags": [
        "game design"
      ]
    },
    {
      "body": "<p><a href=\"http://Shorter.Services\">Shorter.Services</a> is a SAAS application I dreamed up in December 2023. I wanted to make it easier to convert human-readable text from rasterized files into machine-readable data. I also wanted to make money off what I thought was a unique idea.</p>\n<p>Fast forward 10 months, and I came to realize that my idea was not at all unique. At least 5 other, larger companies already had similar offerings. I was disheartened, but I finished the project.</p>\n<p>Maybe there’s a law of technology that says: If you think you have a new idea, someone else has already prototyped it.</p>\n<p>Anyways, I was able to build an efficient web app, and my pricing was very competitive (read: cheap), but I didn’t believe I’d ever make real money off it. Just like my last major project, building the thing was only half the battle.</p>\n<p>Applications are like newborns, they need constant support. At least if I was knitting bibs on Etsy, I could say goodbye to my customers after they buy the thing. With this project, I envisioned so much hand-holding post-sale that it would never pay off.</p>\n<p>Code-wise, it was a joy to build. In the first week, I had a working prototype of the service. Golang especially was a wonderful upgrade from C# and Python, both languages I’ve used in the past. The language conventions around async, error handling, and build speed were just so good.</p>\n<p>Unfortunately, despite the technical prowess, it took me ten more months to finish the rest of the project. A lot of that is because of the UI / frontend. Both took a large amountnof time and effort to design and build. I thought it was a simple enough system, just a few forms. That is my inexperience showing.</p>\n<p>To summarize, Shorter was built on a custom Golang backend and a Sveltekit frontend. It used a remote Neon db and a series of containers from Google, including an OCR utility. It deployed to a pair of lite GCP VMs and used Stripe as a payments provider.</p>\n<p>Would I do it all over again? Even though I know now that it was a failure? Yes, I would. I learned a lot and built something to spec, my spec at least.</p>\n<p>It wasn’t a failure of code, but of marketing.</p>\n",
      "title": "What is Shorter.Services?",
      "date": "2024-12-03 08:00 AM",
      "description": "A side project that was really a lesson in disguise..",
      "isCompleted": true,
      "slug": "what-is-shorter.services",
      "tags": [
        "software dev"
      ]
    },
    {
      "body": "<p>This year, the gaming industry continues to face a number of challenges:</p>\n<ol>\n<li>Big budget, AAA games are bombing with core audiences. (Dragon Age, Star Wars Outlaws, Golum, Call of Duty, and Starfield.)</li>\n<li>Microtransactions continue to shatter immersion and prey on consumers.</li>\n<li>Corporate interferance (risk avoidance) diminishes creativity.</li>\n</ol>\n<p>But overall, I think these issues all stem from the same root problem. If you work in gaming, your north star should be “fun.”</p>\n<p>If you are making decisions based on ego, or the bottom line, you’re going to eventually run afoul of your consumer.</p>\n<p>If the vast majority of players don’t like your decisions, or just don’t want the content, you are not adding latent value, you are subtracting it.</p>\n<p>I believe there is real friction when a player looks through a cosmetic store, at all the content they’ll never use, blatantly aware that the company behind the game is manipulating them.</p>\n<p>This erodes the one thing your game is supposed to do: provide enjoyment.</p>\n<p>Thankfully, the solution is simple. Focus on the consumers needs.</p>\n",
      "title": "Why did gaming struggle in 2024?",
      "date": "2024-12-02 08:00 AM",
      "description": "The video games industry has faced some challenges in 2024.",
      "isCompleted": true,
      "slug": "why-did-gaming-struggle-in-2024",
      "tags": [
        "gaming"
      ]
    },
    {
      "body": "<p><img src=\"sm_logo.png\" alt=\"sm_logo.png\"></p>\n<p>In a synthetic age, I believe the most human thing we can do is to tell stories. Studio Mystery exists to foster and produce those stories, to keep us excited, entertained, and fulfilled. That is the mission of the company.</p>\n<p>This blog will be a tool to support that mission: I plan to post plenty of fiction here, in chapter-length installments, as well as my thoughts on craft and design.</p>\n<p>Some of my thoughts on engineering and code may also wind up here too. All art is political, but not necesarily partisan, so I will try to keep my soapboxing somewhere else.</p>\n<p>Above all, I hope that what I produce brings value to you, my dear reader.</p>\n",
      "title": "Why does this blog exist?",
      "date": "2024-12-01 08:00 AM",
      "description": "I'm an indie game developer trying to build a career, of course I have a blog.",
      "isCompleted": true,
      "slug": "why-does-this-blog-exist",
      "tags": [
        "gaming",
        "game dev",
        "indie games"
      ]
    }
  ]
}